c = input("введите первый цвет:")
c1 = input("введите второй цвет:")
if (c == "красный" and c1 == "синий" )or (c == "синий" and c1 == "красный") :
    print("получится фиолетовый")
if (c == "красный" and c1 == "желтый") or (c == "желтый" and c1 == "красный"):
    print("получится оранжевый")
if (c == "синий" and c1 == "желтый") or (c == "желтый" and c1 == "синий") :
    print("получится зеленый")
if c == c1:
    print("Ошибка")
if ((c ==  "зеленый") or( c ==  "фиолетовый") or (c ==  "оранжевый") ) or ((c1 ==  "зеленый") or( c1 ==  "фиолетовый") or (c1 ==  "оранжевый") ):
    print("Ошибка")


